---
type: FormArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# FormArray

`Autodesk.Revit.DB.FormArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FormArray | — | `public FormArray ()` |
| Method | Append | — | `public virtual void Append ( Form item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual FormArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( Form item , int index )` |
| Method | ReverseIterator | — | `public virtual FormArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual Form this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |